// рисуем лайк с помощью двумерного массива

// в двумерном массиве **int[,] pic = new int[,]; x - строки, а y - столбцы**
//                         кстати не обязательно указывать строки и столбцы, если есть фикс данные
// то есть идём вверх минус строка     x-1, y
// идём влево минус столбец            x, y - 1
// вниз плюс строка                    x+1, y
// вправо плюс столбец                 x, y + 1


void PrintArray(int[,] matr) // функция которая тупо выводит на экран массив
{
    for (int i = 0; i < matr.GetLength(0); i++) //внешний цикл по i - щелкающие строки
    {
        for (int j = 0; j < matr.GetLength(1); j++) //внутрений цикл по j - щелкающие столбцы
        {
            Console.Write($"{matr[i, j]} ");
        }
        Console.WriteLine(); // принудительно соскакиваем на следующую строчку при выводе
    }
}

void PrintImage(int[,] image) //делаем чтобы печатались только 1, чтобы мы отчетливее видели лайк в виде +
{
    for (int i = 0; i < image.GetLength(0); i++) //внешний цикл по i - щелкающие строки
    {
        for (int j = 0; j < image.GetLength(1); j++) //внутрений цикл по j - щелкающие столбцы
        {
            if (image[i, j] == 0)
            {
                Console.Write(" ");
            }
            else
            {
                Console.Write("+");
            }
        }
        Console.WriteLine(); // принудительно соскакиваем на следующую строчку при выводе
    }
}

void FillImage(int[,] pic, int row, int col) //функция закраски (в аргумент передаём, массив, позицию строки и столбца где будет пиксель с которого начинаем закраску)
{
    if (pic[row, col] == 0) //если пиксель по указанной позиции [щелкающих row и col] не закрашен 0
    {
        pic[row, col] = 1;
        FillImage(pic, row - 1, col); //функция вызывает сама себя и передаёт куда двишатся пикселю (в данном случае как договаривались наверх -строка, столбец на месте)
        FillImage(pic, row, col - 1); //идем влево (строка на месте, столбец -1)
        FillImage(pic, row + 1, col); //идем вниз (строка +1, столбец на месте)
        FillImage(pic, row, col + 1); //идем вправо (строка на месте, столбец +1)
    }
}

int[,] pic = new int[,]
{
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
    {0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
    {0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
    {0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0 },
    {0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0 },
    {0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0 },
    {0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 0, 0, 0 },
    {0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0 },
    {0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0 },
    {0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 0, 0, 0 },
    {0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0 },
    {0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0 },
    {0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0 },
    {0, 0, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0 },
    {0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0 },
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0 },
    {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
};

PrintArray(pic);
PrintImage(pic);
FillImage(pic, 13, 13);
PrintImage(pic);